Reports/бит_КопияФинансовоЛицевогоСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>бит_КопияФинансовоЛицевогоСчета</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СохраненныеНастройки</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПостроительОтчета</Name>
					<Type>
						<v8:Type>cfg:ReportBuilder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсеПериоды</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОтчетовФинансовоЛицевогоСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсторияПроживающих</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СведенияОЛьготах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусФизЛица</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СУчетомПереплаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаполненоГЦЖС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьПочтовыйАдрес</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьВсеУслугиВСправку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВыводитьНеПроживающих</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Enums/бит_ВидыОтчетовФинансовоЛицевогоСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ВидыОтчетовФинансовоЛицевогоСчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Полный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Основной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолныйСтр2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Остатки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Справка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выписка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СправкаБалашиха</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолныйСПеня</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолныйСПеняСтр2</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/бит_ДоступныеПериодыОтчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ДоступныеПериодыОтчета</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольныйПериод</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/бит_КопияФинансовоЛицевогоСчета/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область ПроцедурыИФункцииУправленияВнешнимВидомФормы

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстЗаголовка(Форма)
	
	Отчет = Форма.Отчет;
	
	ЗаголовокОтчета = "Копия финансово-лицевого счета " + бит_ВыборПериодаКлиентСервер.ПолучитьПредставлениеПериодаОтчета(Форма.ВидПериода, Отчет.НачалоПериода, Отчет.КонецПериода);
	
	Если ЗначениеЗаполнено(Отчет.ЛицевойСчет) Тогда
		ЗаголовокОтчета = ЗаголовокОтчета + " по " + Отчет.ЛицевойСчет;
	КонецЕсли;
	
	Форма.Заголовок = ЗаголовокОтчета;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Отчет    = Форма.Отчет;
	Элементы = Форма.Элементы;
	
	Если Отчет.ВидОтчета = ПредопределенноеЗначение("Перечисление.бит_ВидыОтчетовФинансовоЛицевогоСчета.Выписка") 
		ИЛИ Отчет.ВидОтчета = ПредопределенноеЗначение("Перечисление.бит_ВидыОтчетовФинансовоЛицевогоСчета.Справка") Тогда
		
		Элементы.ИсторияПроживающих.Доступность = Ложь;
		Элементы.СведенияОЛьготах.Доступность   = Ложь;
		Элементы.СтатусФизЛица.Доступность      = Ложь;
		Элементы.СУчетомПереплаты.Доступность   = Ложь;
		Элементы.ВыводитьВсеУслугиВСправку.Доступность = Истина;
		
		Форма.ВидПериода = ПредопределенноеЗначение("Перечисление.бит_ДоступныеПериодыОтчета.День");
		Элементы.ВидПериода.Доступность   = Ложь;
		
	Иначе
		
		Элементы.ИсторияПроживающих.Доступность = Истина;
		Элементы.СведенияОЛьготах.Доступность   = Истина;
		Элементы.СтатусФизЛица.Доступность      = Истина;
		Элементы.СУчетомПереплаты.Доступность   = Истина;
		Элементы.ВыводитьВсеУслугиВСправку.Доступность = Ложь;
		
		Элементы.ВидПериода.Доступность   = Истина;
		
	КонецЕсли;
	
КонецПроцедуры // () 

#КонецОбласти
   
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Отчет.НачалоПериода) Тогда
		Отчет.НачалоПериода = НачалоМесяца(ТекущаяДатаСеанса());
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Отчет.КонецПериода) Тогда
		Отчет.КонецПериода = КонецМесяца(ТекущаяДатаСеанса());
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Отчет.ВидОтчета) Тогда
		Отчет.ВидОтчета = ПредопределенноеЗначение("Перечисление.бит_ВидыОтчетовФинансовоЛицевогоСчета.Полный");
	КонецЕсли;
	
	// БИТ_ЖКХ 23.05.2016 18:16:15 Начало правки...
	ПериодСтандарт.ДатаНачала	 = Отчет.НачалоПериода;
	ПериодСтандарт.ДатаОкончания = Отчет.КонецПериода;
	// БИТ_ЖКХ 23.05.2016 18:16:15 Конец правки.
	
	бит_ВыборПериодаКлиентСервер.ЗаполнитьСписокВыбораВидПериода(
	ПредопределенноеЗначение("Перечисление.бит_ДоступныеПериодыОтчета.День"),
	Элементы.ВидПериода.СписокВыбора, ВидПериода);
	
	// БИТ_ЖКХ_05082013_начало_изменений		
	Параметры.Свойство("ЛицевойСчет", Отчет.ЛицевойСчет);
	// БИТ_ЖКХ_05082013_окончание_изменений
	
	ОбновитьТекстЗаголовка(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииПользовательскихНастроекНаСервере(Настройки)
	
	бит_ОтчетыВызовСервера.ПриСохраненииПользовательскихНастроекНаСервере(ЭтаФорма, Настройки, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки)
	
	бит_ОтчетыВызовСервера.ПриЗагрузкеПользовательскихНастроекНаСервере(ЭтаФорма, Настройки);
	
	ОбновитьТекстЗаголовка(ЭтаФорма);
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// БИТ_ЖКХ_05082013_начало_изменений
	ОбновитьТекстЗаголовка(ЭтаФорма);
	// БИТ_ЖКХ_05082013_окончание_изменений
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти
   
#Область ДействияКомандФормы

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	ВидПериодаПриИзменении(Элементы.ВидПериода);
	СформироватьОтчетНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Настройка(Команда)
	
	Элементы.ГруппаПанельНастроек.Видимость = НЕ Элементы.ГруппаПанельНастроек.Видимость;
	
КонецПроцедуры

#КонецОбласти
   
#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ЛицевойСчетПриИзменении(Элемент)
	
	бит_ОтчетыКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОтчетаПриИзменении(Элемент)
	
	УправлениеФормой(ЭтаФорма);
	ВидПериодаПриИзменении(Элементы.ВидПериода);
	бит_ОтчетыКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	
КонецПроцедуры

#КонецОбласти
   
#Область ПроцедурыИФункцииУправленияПериодом

&НаКлиенте
Процедура ВидПериодаПриИзменении(Элемент)
	
	бит_ВыборПериодаКлиент.ВидПериодаПриИзменении(Элемент, ВидПериода, Отчет.НачалоПериода, Отчет.КонецПериода, Период);
	бит_ВыборПериодаКлиентСервер.ПереключитьТекущуюСтраницуВыбораПериода(ВидПериода, Элементы.ГруппаПоляВводаПериода);
	
	ОбновитьТекстЗаголовка(ЭтаФорма);
	
	бит_ОтчетыКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	
	ОбновитьТекстЗаголовка(ЭтаФорма);
	
	бит_ОтчетыКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)
	
	ОбновитьТекстЗаголовка(ЭтаФорма);
	
	бит_ОтчетыКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаДеньПриИзменении(Элемент)
	
	Отчет.КонецПериода = КонецДня(Отчет.НачалоПериода);
	
	ОбновитьТекстЗаголовка(ЭтаФорма);
	
	бит_ОтчетыКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	бит_ВыборПериодаКлиент.ПериодПриИзменении(Элемент, Период, Отчет.НачалоПериода, Отчет.КонецПериода);
	
	ОбновитьТекстЗаголовка(ЭтаФорма);
	
	бит_ОтчетыКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	бит_ВыборПериодаКлиент.ПериодНачалоВыбораИзСписка(ЭтаФорма, Элемент, СтандартнаяОбработка, 
	ВидПериода, Период, Отчет.НачалоПериода, Отчет.КонецПериода);
	
	ОбновитьТекстЗаголовка(ЭтаФорма);
	
	бит_ОтчетыКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	бит_ВыборПериодаКлиент.ПериодОбработкаВыбора(
	Элемент, ВыбранноеЗначение, СтандартнаяОбработка,
	ВидПериода, Период, Отчет.НачалоПериода, Отчет.КонецПериода);
	
	ОбновитьТекстЗаголовка(ЭтаФорма);
	
	бит_ОтчетыКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	бит_ВыборПериодаКлиент.ПериодАвтоПодбор(
	Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка,
	ВидПериода, Период, Отчет.НачалоПериода, Отчет.КонецПериода);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	бит_ВыборПериодаКлиент.ПериодОкончаниеВводаТекста(
	Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка,
	ВидПериода, Период, Отчет.НачалоПериода, Отчет.КонецПериода);
	
КонецПроцедуры

// БИТ_ЖКХ 23.05.2016 18:11:48 Начало правки... 
&НаКлиенте
Процедура ПериодСтандартДатаНачалаПриИзменении(Элемент)
	
	Отчет.НачалоПериода = ПериодСтандарт.ДатаНачала;
	ОбновитьТекстЗаголовка(ЭтаФорма);
	бит_ОтчетыКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодСтандартДатаОкончанияПриИзменении(Элемент)
	
	Отчет.КонецПериода = КонецДня(ПериодСтандарт.ДатаОкончания);
	ОбновитьТекстЗаголовка(ЭтаФорма);
	бит_ОтчетыКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодСтандартВариантПриИзменении(Элемент)
	
	Отчет.НачалоПериода = ПериодСтандарт.ДатаНачала;
	Отчет.КонецПериода = КонецДня(ПериодСтандарт.ДатаОкончания);
	ОбновитьТекстЗаголовка(ЭтаФорма);
	бит_ОтчетыКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	
КонецПроцедуры
// БИТ_ЖКХ 23.05.2016 18:11:51 Конец правки. 

#КонецОбласти
   
#Область ПрочиеПроцедурыИФункции

&НаСервере
Функция ПодготовитьПараметрыОтчета()
	
	//19.09.2019
	Отчет.НачалоПериода = ПериодСтандарт.ДатаНачала;
	Отчет.КонецПериода = КонецДня(ПериодСтандарт.ДатаОкончания);
	
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("ЛицевойСчет"                         , Отчет.ЛицевойСчет);
	ПараметрыОтчета.Вставить("НачалоПериода"                       , Отчет.НачалоПериода);
	ПараметрыОтчета.Вставить("КонецПериода"                        , Отчет.КонецПериода);
	ПараметрыОтчета.Вставить("Период"                              , Отчет.КонецПериода);
	ПараметрыОтчета.Вставить("ВидОтчета"                           , Отчет.ВидОтчета);
	ПараметрыОтчета.Вставить("ИсторияПроживающих"                  , Отчет.ИсторияПроживающих);
	ПараметрыОтчета.Вставить("СведенияОЛьготах"                    , Отчет.СведенияОЛьготах);
	ПараметрыОтчета.Вставить("СтатусФизЛица"                       , Отчет.СтатусФизЛица);
	ПараметрыОтчета.Вставить("СУчетомПереплаты"                    , Отчет.СУчетомПереплаты);
	ПараметрыОтчета.Вставить("ЗаполненоГЦЖС"                       , Отчет.ЗаполненоГЦЖС);
	ПараметрыОтчета.Вставить("ВыводитьПочтовыйАдрес"               , Отчет.ВыводитьПочтовыйАдрес);
	ПараметрыОтчета.Вставить("ВыводитьВсеУслугиВСправку"           , Отчет.ВыводитьВсеУслугиВСправку);
	
	// БИТ_ЖКХ 28.05.2014
	ПараметрыОтчета.Вставить("НеВыводитьНеПроживающих"             , Отчет.НеВыводитьНеПроживающих);
	// БИТ_ЖКХ 28.05.2014
	
	//Если Отчет.ВидОтчета = Перечисления.бит_ВидыОтчетовФинансовоЛицевогоСчета.Выписка
	//	ИЛИ Отчет.ВидОтчета = Перечисления.бит_ВидыОтчетовФинансовоЛицевогоСчета.Справка Тогда
	//	
	//	ПараметрыОтчета.КонецПериода = НачалоМесяца(ПериодСтандарт.ДатаОкончания);
	//	ПараметрыОтчета.Период = ПараметрыОтчета.КонецПериода;
	//	
	//КонецЕсли; 
	
	//Если Отчет.ВидОтчета = Перечисления.бит_ВидыОтчетовФинансовоЛицевогоСчета.Справка Тогда
	//	
	//	ПараметрыОтчета.НачалоПериода = НачалоМесяца(Отчет.НачалоПериода);
	//	
	//КонецЕсли; 

	Если Отчет.ВидОтчета = Перечисления.бит_ВидыОтчетовФинансовоЛицевогоСчета.Выписка
		ИЛИ Отчет.ВидОтчета = Перечисления.бит_ВидыОтчетовФинансовоЛицевогоСчета.Справка Тогда
		
		ПараметрыОтчета.НачалоПериода = НачалоМесяца(Отчет.НачалоПериода);
		
	КонецЕсли; 

	
	Возврат ПараметрыОтчета;
	
КонецФункции

&НаСервере
// Процедура формирования отчета.
//
// Параметры:
//  Параметр1 – Строка.
//
Функция СформироватьОтчетНаСервере()
	
	бит_ОтчетыКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеИспользовать");
	
	ПараметрыОтчета = ПодготовитьПараметрыОтчета();
	
	АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	Отчеты.бит_КопияФинансовоЛицевогоСчета.СформироватьОтчет(ПараметрыОтчета, АдресХранилища);
	РезультатВыполнения = Новый Структура("ЗаданиеВыполнено", Истина);
	
	Если РезультатВыполнения.ЗаданиеВыполнено Тогда
		ЗагрузитьПодготовленныеДанные();
	КонецЕсли;
	
	Возврат РезультатВыполнения;
	
КонецФункции // () 

&НаСервере
Процедура ЗагрузитьПодготовленныеДанные()
	
	Результат.Очистить();
	
	РезультатВыполнения = ПолучитьИзВременногоХранилища(АдресХранилища);
	Результат.Вывести(РезультатВыполнения);
	
	бит_ОтчетыКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеИспользовать");
	
КонецПроцедуры


#КонецОбласти
